Thank you for this issue! This issue involves bugs that Terraform has not resolved or just resolved a few weeks ago, frankly, it is indeed a long process for me to dig deep into the root cause, sorry for the late reply!

This issue involves two BUGs of Terraform:
1. store absolute addresses for resource dependencies in the state
https://github.com/hashicorp/terraform/pull/23252
https://github.com/hashicorp/terraform/issues/23635
create_before_destroy or a 2-step update + terraform 0.13 is needed in this case

2. Incorrect "Provider produced inconsistent final plan" error when changing count or for_each of resources with create_before_destroy
https://github.com/hashicorp/terraform/issues/25631
terraform 0.14 Beta is needed in this case

**Solution:  terraform 0.14 Beta + create_before_destroy**

**Step1:** Create TF files. The following is a simulation of your configuration, if it is not right, please correct me:
```
# tree
├── maintst.tf
└── modules
    └── address-group-builder
        ├── main.tf
        └── variables.tf

# cat maintst.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token = "rGqsgj9Qmh3dwfQdc8hd3t3G6xG3N5"
}

module "google_dns_address_group" {
  source = "./modules/address-group-builder"

  address_group_name = "google-dns"
  comment            = "Google DNS Servers"

  address_object_subnets = {
    google_dns_4s = {
      network = "8.8.4.4"
      mask    = "255.255.255.255"
    }

    google_dns_8s = {
      network = "8.8.8.8"
      mask    = "255.255.255.255"
    }
  }
}

# cat modules/address-group-builder/variables.tf
variable "address_group_name" {
  type = string
}

variable "comment" {
  type = string
}

variable "address_object_subnets" {
  type = map(object({
    network = string
    mask    = string
  }))
}

# cat modules/address-group-builder/main.tf
resource "fortios_firewall_address" "addrtr" {
  for_each = var.address_object_subnets
  name     = each.key
  subnet   = join(" ", [each.value.network, each.value.mask])
  type     = "ipmask"
  lifecycle {
    create_before_destroy = true
  }
}

resource "fortios_firewall_addrgrp" "grptr" {
  allow_routing = "disable"
  color         = 0
  exclude       = "disable"
  name          = var.address_group_name
  visibility    = "enable"
  comment       = var.comment

  dynamic member {
    for_each = fortios_firewall_address.addrtr
    content {
      name = member.value.name
    }
  }
}
```
Please note the code: 
```
  lifecycle {
    create_before_destroy = true
  }
```

**Step2:** Use the # terraform graph | dot -Tsvg> graph.svg command to generate a relationship graph for the TF code to check the dependency graph first, we need to ensure that there is a clear dependency between address groups and addresses:
![graph](https://user-images.githubusercontent.com/49291382/98610313-48170980-232a-11eb-8989-b3ab981d874e.jpg)

**Step3:** terraform plan and terraform apply:

```
# terraform plan
...
# terraform apply
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_4s"] will be created
  + resource "fortios_firewall_address" "addrtr" {
      + allow_routing        = (known after apply)
      + associated_interface = (known after apply)
      + cache_ttl            = (known after apply)
      + color                = (known after apply)
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "google_dns_4s"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = "8.8.4.4 255.255.255.255"
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "ipmask"
      + uuid                 = (known after apply)
      + visibility           = (known after apply)
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_8s"] will be created
  + resource "fortios_firewall_address" "addrtr" {
      + allow_routing        = (known after apply)
      + associated_interface = (known after apply)
      + cache_ttl            = (known after apply)
      + color                = (known after apply)
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "google_dns_8s"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = "8.8.8.8 255.255.255.255"
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "ipmask"
      + uuid                 = (known after apply)
      + visibility           = (known after apply)
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # module.google_dns_address_group.fortios_firewall_addrgrp.grptr will be created
  + resource "fortios_firewall_addrgrp" "grptr" {
      + allow_routing = "disable"
      + color         = 0
      + comment       = "Google DNS Servers"
      + exclude       = "disable"
      + id            = (known after apply)
      + name          = "google-dns"
      + uuid          = (known after apply)
      + visibility    = "enable"

      + member {
          + name = "google_dns_4s"
        }
      + member {
          + name = "google_dns_8s"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_8s"]: Creating...
module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_4s"]: Creating...
module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_4s"]: Creation complete after 0s [id=google_dns_4s]
module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_8s"]: Creation complete after 0s [id=google_dns_8s]
module.google_dns_address_group.fortios_firewall_addrgrp.grptr: Creating...
module.google_dns_address_group.fortios_firewall_addrgrp.grptr: Creation complete after 0s [id=google-dns]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```
**Step4:** remove one or more address from maintst.tf:
```

# cat maintst.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token = "rGqsgj9Qmh3dwfQdc8hd3t3G6xG3N5"
}

module "google_dns_address_group" {
  source = "./modules/address-group-builder"

  address_group_name = "google-dns"
  comment            = "Google DNS Servers"

  address_object_subnets = {
    google_dns_4s = {
      network = "8.8.4.4"
      mask    = "255.255.255.255"
    }
  }
}

```
**Step5**: terraform plan and terraform apply again (Hint: terraform 0.14 Beta is needed)
```
# terraform plan
  ----
module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_4s"]: Refreshing state... [id=google_dns_4s]
module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_8s"]: Refreshing state... [id=google_dns_8s]
module.google_dns_address_group.fortios_firewall_addrgrp.grptr: Refreshing state... [id=google-dns]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_8s"] will be destroyed
  - resource "fortios_firewall_address" "addrtr" {
      - allow_routing = "disable" -> null
      - cache_ttl     = 0 -> null
      - color         = 0 -> null
      - end_ip        = "255.255.255.255" -> null
      - id            = "google_dns_8s" -> null
      - name          = "google_dns_8s" -> null
      - start_ip      = "8.8.8.8" -> null
      - subnet        = "8.8.8.8 255.255.255.255" -> null
      - type          = "ipmask" -> null
      - uuid          = "eba59c4c-19b1-51eb-2127-7a81747743e0" -> null
      - visibility    = "enable" -> null
      - wildcard      = "8.8.8.8 255.255.255.255" -> null
    }

  # module.google_dns_address_group.fortios_firewall_addrgrp.grptr will be updated in-place
  ~ resource "fortios_firewall_addrgrp" "grptr" {
        id            = "google-dns"
        name          = "google-dns"
        # (6 unchanged attributes hidden)

      - member {
          - name = "google_dns_8s" -> null
        }
        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

# terraform apply
  ----
module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_4s"]: Refreshing state... [id=google_dns_4s]
module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_8s"]: Refreshing state... [id=google_dns_8s]
module.google_dns_address_group.fortios_firewall_addrgrp.grptr: Refreshing state... [id=google-dns]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_8s"] will be destroyed
  - resource "fortios_firewall_address" "addrtr" {
      - allow_routing = "disable" -> null
      - cache_ttl     = 0 -> null
      - color         = 0 -> null
      - end_ip        = "255.255.255.255" -> null
      - id            = "google_dns_8s" -> null
      - name          = "google_dns_8s" -> null
      - start_ip      = "8.8.8.8" -> null
      - subnet        = "8.8.8.8 255.255.255.255" -> null
      - type          = "ipmask" -> null
      - uuid          = "eba59c4c-19b1-51eb-2127-7a81747743e0" -> null
      - visibility    = "enable" -> null
      - wildcard      = "8.8.8.8 255.255.255.255" -> null
    }

  # module.google_dns_address_group.fortios_firewall_addrgrp.grptr will be updated in-place
  ~ resource "fortios_firewall_addrgrp" "grptr" {
        id            = "google-dns"
        name          = "google-dns"
        # (6 unchanged attributes hidden)

      - member {
          - name = "google_dns_8s" -> null
        }
        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.google_dns_address_group.fortios_firewall_addrgrp.grptr: Modifying... [id=google-dns]
module.google_dns_address_group.fortios_firewall_addrgrp.grptr: Modifications complete after 0s [id=google-dns]
module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_8s"]: Destroying... [id=google_dns_8s]
module.google_dns_address_group.fortios_firewall_address.addrtr["google_dns_8s"]: Destruction complete after 0s

Apply complete! Resources: 0 added, 1 changed, 1 destroyed.

```
We can see that terraform can interpret the dependencies correctly and apply the configuration correctly now. Thanks!

